## Preparing the original csv from source: https://www.citibikenyc.com/system-data

In [1]:
import pandas as pd

In [2]:
#Using pandas to read the dataframe
Jan_21_full = pd.read_csv ('Jan_21.csv')
Jan_21_full.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,266,2021-01-01 00:03:35.5100,2021-01-01 00:08:01.7770,3273,Manila & 1st,40.721651,-74.042884,3209,Brunswick St,40.724176,-74.050656,42494,Subscriber,1988,1
1,1543,2021-01-01 00:23:32.9250,2021-01-01 00:49:16.0830,3681,Grand St,40.715178,-74.037683,3213,Van Vorst Park,40.718489,-74.047727,45343,Customer,1996,2
2,1461,2021-01-01 00:23:50.7940,2021-01-01 00:48:12.5660,3681,Grand St,40.715178,-74.037683,3213,Van Vorst Park,40.718489,-74.047727,31794,Customer,1995,1
3,793,2021-01-01 00:31:09.0770,2021-01-01 00:44:22.9430,3185,City Hall,40.717733,-74.043845,3199,Newport Pkwy,40.728745,-74.032108,42316,Customer,1969,0
4,596,2021-01-01 00:35:52.1900,2021-01-01 00:45:48.7740,3639,Harborside,40.719252,-74.034234,3209,Brunswick St,40.724176,-74.050656,32575,Customer,1969,0

In [3]:
#Creating new dataframe that only holds the desired columns
jan_21_df=Jan_21_full[["usertype","birth year", "gender"]]
jan_21_df

         usertype  birth year  gender
0      Subscriber        1988       1
1        Customer        1996       2
2        Customer        1995       1
3        Customer        1969       0
4        Customer        1969       0
...           ...         ...     ...
11619  Subscriber        1958       1
11620  Subscriber        1972       1
11621  Subscriber        1987       2
11622  Subscriber        1989       1
11623  Subscriber        1994       1

[11624 rows x 3 columns]

## Data Cleaning

In [15]:
#Dropping rows where gender = 0 (unknown)
clean_1 = jan_21_df[jan_21_df.gender != 0]
clean_1

         usertype  birth year  gender
0      Subscriber        1988       1
1        Customer        1996       2
2        Customer        1995       1
5      Subscriber        1990       1
7      Subscriber        1958       1
...           ...         ...     ...
11619  Subscriber        1958       1
11620  Subscriber        1972       1
11621  Subscriber        1987       2
11622  Subscriber        1989       1
11623  Subscriber        1994       1

[10419 rows x 3 columns]